In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
pd.Series([1,3,5,6,8])

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [4]:
df=pd.DataFrame(data=np.arange(1,49).reshape(12,4), columns=['X1','X2','X3','X4'])
df

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
2    9  10  11  12
3   13  14  15  16
4   17  18  19  20
5   21  22  23  24
6   25  26  27  28
7   29  30  31  32
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      12 non-null     int32
 1   X2      12 non-null     int32
 2   X3      12 non-null     int32
 3   X4      12 non-null     int32
dtypes: int32(4)
memory usage: 320.0 bytes

In [6]:
df.describe()

              X1         X2         X3         X4
count  12.000000  12.000000  12.000000  12.000000
mean   23.000000  24.000000  25.000000  26.000000
std    14.422205  14.422205  14.422205  14.422205
min     1.000000   2.000000   3.000000   4.000000
25%    12.000000  13.000000  14.000000  15.000000
50%    23.000000  24.000000  25.000000  26.000000
75%    34.000000  35.000000  36.000000  37.000000
max    45.000000  46.000000  47.000000  48.000000

In [8]:
df.sort_values(by="X2", ascending=False)

    X1  X2  X3  X4
11  45  46  47  48
10  41  42  43  44
9   37  38  39  40
8   33  34  35  36
7   29  30  31  32
6   25  26  27  28
5   21  22  23  24
4   17  18  19  20
3   13  14  15  16
2    9  10  11  12
1    5   6   7   8
0    1   2   3   4

### 판다스로 데이터가지고 놀기

In [9]:
df["X1"]

0      1
1      5
2      9
3     13
4     17
5     21
6     25
7     29
8     33
9     37
10    41
11    45
Name: X1, dtype: int32

In [10]:
df.loc[0]

X1    1
X2    2
X3    3
X4    4
Name: 0, dtype: int32

In [11]:
df.loc[0][2]

3

In [12]:
df.loc[0]["X3"]

3

In [16]:
# df.loc에 2차원 indexing도 가능하다.
# df.loc["row에 대한 조건", "col에 대한 조건"]

df.loc[4,"X2"]
df.loc[[0,3],["X1","X3"]]
df.loc[0:4, "X1":"X3"]

   X1  X2  X3
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15
4  17  18  19

In [21]:
mask = df["X1"] > 10  # row에 대한 조건
df.loc[mask]

df.loc[df["X2"] >= 20]

df.loc[df["X2"] >= 20, "X4"]

5     24
6     28
7     32
8     36
9     40
10    44
11    48
Name: X4, dtype: int32

In [25]:
df.loc[(df["X3"] >= 10) & (df["X3"] <= 30)]

   X1  X2  X3  X4
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24
6  25  26  27  28

In [26]:
df.loc[(30 < df["X2"]) | (10 > df["X2"])]

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [29]:
# row 8번째 까지, column 2번째 까지
df.iloc[3:8, 0:2]

   X1  X2
3  13  14
4  17  18
5  21  22
6  25  26
7  29  30

### 실제 데이터로 사용해보기
#### 데이터 사이트 : https://www.kaggle.com/c/titanic/data

In [3]:
titanic = pd.read_csv("./data/titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
titanic.loc[titanic["Age"] >= 30, "Name"]

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
6                                McCarthy, Mr. Timothy J
11                              Bonnell, Miss. Elizabeth
                             ...
873                          Vander Cruyssen, Mr. Victor
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
881                                   Markun, Mr. Johann
885                 Rice, Mrs. William (Margaret Norton)
890                                  Dooley, Mr. Patrick
Name: Name, Length: 330, dtype: object

In [7]:
pd.pivot_table(data = titanic, index = "Sex", values = "Survived") # mean

        Survived
Sex
female  0.742038
male    0.188908

In [9]:
# 평균, 합계, 수 함께 보기
pd.pivot_table(data=titanic, index="Sex", values="Survived", aggfunc=["mean","sum","count"])

# 유의미하게 여성들이 많이 살아남았다.

            mean      sum    count
        Survived Survived Survived
Sex
female  0.742038      233      314
male    0.188908      109      577

In [13]:
pd.pivot_table(data=titanic, index=["Pclass","Sex"], values="Survived", aggfunc=["count","sum","mean"])

                 count      sum      mean
              Survived Survived  Survived
Pclass Sex
1      female       94       91  0.968085
       male        122       45  0.368852
2      female       76       70  0.921053
       male        108       17  0.157407
3      female      144       72  0.500000
       male        347       47  0.135447

In [14]:
### 엑셀 데이터 병합하기